window.SKILL_DATABASE = {
  // [0차/기타]
  "청풍보": 0, "매화비보": 0, "청풍유심": 0, "청허심경": 0, "청허심경 II": 0, "청허심경 III": 0, "청허심경 IV": 0,
  "아니마의 용사": 0, "아니마 용사의 의지": 0, "로프 커넥트": 0, "블링크": 0, "에르다의 의지": 0, "신체 단련": 0,
  
  // [1차]
  "매화검 본초 : 참": 1, "매화검 본초 : 자": 1, "매화검 1초식 : 순인": 1, "매화검 1초식 : 순인-발검": 1, 
  "매화검 1초식 : 순인-납검": 1, "망혼검 본초 : 영격": 1, "장검 숙련": 1, "장검 가속": 1,
  
  // [2차]
  "매화검 본초 : 천": 2, "매화검 2초식 : 쇄매": 2, "망혼검 본초 : 영격 II": 2, "망혼검 1초식 : 운기": 2,
  
  // [3차]
  "매화검 3초식 : 예인": 3, "망혼검 본초 : 영격 III": 3, "망혼검 2초식 : 연참": 3, "망혼검 절기 : 열지": 3,
  "망혼검 절기 : 망탄": 3, "강신": 3, "망혼강림": 3, "오도": 3,
  
  // [4차/하이퍼]
  "매화검 4초식 : 영인": 4, "매화검 5초식 : 천매지박": 4, "망혼검 절기 : 무량겁": 4, "고급 장검 숙련": 4,
  "진안": 4, "오라 웨폰": 4, "바디 오브 스틸": 4, "일격필살 I": 4,
  
  // [5차] (강화 코어 및 스킬)
  "매화검 절기 : 만리향": 5, "망혼각성": 5, "매화검 절기 : 섬무": 5, "망혼검 절기 : 심검": 5,
  "에르다 노바": 5, "에르다 샤워": 5, "스파이더 인 미러": 5, "그란디스 여신의 축복": 5, "크레스트 오브 더 솔라": 5, 
  "화중군자": 5, "쓸만한 샤프 아이즈": 5, "쓸만한 컴뱃 오더스": 5, "쓸만한 윈드 부스터": 5, "쓸만한 홀리 심볼": 5,
  
  // [6차]
  "솔 야누스": 6, "솔 야누스 : 새벽": 6, "솔 헤카테": 6, "솔 헤카테 : 스틱스": 6, "솔 헤카테 : 팩텀": 6,
  "매화검 본초 : 선참 VI": 6, "망혼검 본초 : 영격 VI": 6, "망혼강림 VI": 6, "망혼검 절기 : 열지 VI": 6,
  "망혼검 절기 : 망탄 VI": 6, "망혼검 절기 : 무량겁 VI": 6, "매화검 2초식 : 쇄매 VI": 6, "매화검 3초식 : 예인 VI": 6,
  "망혼검 2초식 : 연참 VI": 6, "화중군자 VI": 6
};